/****************************************************************************/
/*文件名称： LEDSEG7.C                                                        */
/*实验现象： 数码管依次显示出0、1，2、……9、a、b、C、d、E、F                          */
/****************************************************************************/
#include "configure.h"

#ifdef __LEDDEMO_EN
#define U8 unsigned char
#define LED_ADDR *(unsigned char*)0x02000000
extern unsigned char seg7table[];
/****************************************************************************/
/* 函数说明: JX44B0 7段构共阳数码管测试                                           */
/* 功能描述: 依次在7段数码管上显示0123456789ABCDEF                                */
/* 返回代码: 无                                                               */
/* 参数说明: 无                                                               */
/****************************************************************************/
 
void main(void) {    
	int i;        
	*((U8*) 0x02000006) = 0x00;	  /* 设置数码管段选，某位为0时选择，下面同时选中所有数码管 */
        
	while(1){
		  


	    for(i=0;i<0x10;i++){                       /* 数码管从0到F依次将字符显示出来 */			 
	    	*((U8*) 0x02000004) = seg7table[i];    /* 查表并输出数据 */
	    	Delay (3000);   	   
   		}
		
		for(i=0xf;i>=0x0;i--){                    /* 数码管从F到0依次将字符显示出来 */
	        *((U8*) 0x02000004) = seg7table[i];   /* 查表并输出数据 */	          
	   		Delay (3000);		
	 	}



	 }
}
#endif //__LEDDEMO_EN